{
  "facts": [
    "The speed of light in vacuum is approximately 299,792,458 meters per second.",
    "Water is the only substance on Earth that naturally occurs in three states: solid, liquid, and gas.",
    "The human brain contains approximately 86 billion neurons.",
    "DNA was first isolated by Friedrich Miescher in 1869.",
    "The Earth's core is as hot as the surface of the Sun, reaching temperatures of about 5,700°C.",
    "A single bolt of lightning contains enough energy to toast 100,000 slices of bread.",
    "Oxygen was discovered independently by Carl Wilhelm Scheele and Joseph Priestley in the 1770s.",
    "The Milky Way galaxy contains an estimated 100-400 billion stars.",
    "Human DNA is 99.9% identical between any two individuals.",
    "The universe is approximately 13.8 billion years old.",
    "Electrons move through the wire at a speed of a few centimeters per second.",
    "A teaspoon of neutron star material would weigh about 6 billion tons.",
    "The speed of sound varies depending on the medium it travels through.",
    "Photosynthesis converts carbon dioxide and water into glucose using light energy.",
    "The periodic table was created by Dmitri Mendeleev in 1869.",
    "Quantum entanglement allows particles to be instantly connected across vast distances.",
    "The human genome contains approximately 3 billion base pairs.",
    "Black holes can slow down time due to their extreme gravitational fields.",
    "Chlorophyll makes plants green by absorbing red and blue light.",
    "Sound cannot travel through a vacuum because there are no particles to vibrate.",
    "The largest volcano in our solar system is Olympus Mons on Mars.",
    "Penicillin was discovered accidentally by Alexander Fleming in 1928.",
    "The coldest temperature ever recorded on Earth was -89.2°C in Antarctica.",
    "Diamonds are formed under extreme pressure and temperature deep within Earth.",
    "The human eye can distinguish about 10 million different colors.",
    "Bacteria make up approximately 90% of the cells in the human body.",
    "The aurora borealis is caused by solar particles colliding with Earth's atmosphere.",
    "A single strand of spider silk is stronger than steel of the same thickness.",
    "The fastest computer processor can perform trillions of calculations per second.",
    "Helium was first discovered on the Sun before being found on Earth.",
    "The human heart beats approximately 100,000 times per day.",
    "Graphene is the strongest material ever tested, 200 times stronger than steel.",
    "The Earth's magnetic field is generated by its liquid iron core.",
    "A single human brain generates more electrical impulses in a day than all telephones in the world combined.",
    "The International Space Station travels at a speed of about 28,000 km/h.",
    "Vaccines work by training the immune system to recognize and fight pathogens.",
    "The smallest bone in the human body is the stapes in the middle ear.",
    "Nuclear fusion in the Sun converts 600 million tons of hydrogen into helium every second.",
    "The Great Barrier Reef is the largest living structure on Earth.",
    "Antibiotics are ineffective against viral infections.",
    "The Hubble Space Telescope has observed galaxies up to 13.4 billion light-years away.",
    "Water expands when it freezes, which is why ice floats.",
    "The human body contains enough carbon to make 900 pencils.",
    "Mitochondria are the powerhouses of cells, generating ATP for energy.",
    "The planet Venus has a day longer than its year.",
    "Gravity is the weakest of the four fundamental forces of nature.",
    "The first synthetic element was Technetium, created in 1937.",
    "Electromagnetic waves include radio waves, microwaves, infrared, visible light, ultraviolet, X-rays, and gamma rays.",
    "The human skeleton is composed of 206 bones in adulthood.",
    "Pluto was reclassified as a dwarf planet in 2006.",
    "The Doppler effect explains why a siren's pitch changes as it moves past you.",
    "RNA can act as both genetic material and as enzymes called ribozymes.",
    "The Hubble constant measures the rate of expansion of the universe.",
    "Stem cells have the potential to develop into many different cell types.",
    "The Earth rotates at a speed of about 1,670 km/h at the equator.",
    "Superconductors conduct electricity without resistance at very low temperatures.",
    "The chemical formula for table salt is NaCl (sodium chloride).",
    "A light-year is the distance light travels in one year, about 9.46 trillion kilometers.",
    "The human stomach can hold approximately 1.5 liters of material.",
    "CRISPR technology allows precise editing of DNA sequences.",
    "The greenhouse effect is essential for life but is enhanced by human activities.",
    "Absolute zero is the lowest possible temperature at -273.15°C or 0 Kelvin.",
    "The ozone layer protects Earth from harmful ultraviolet radiation.",
    "Enzymes are biological catalysts that speed up chemical reactions.",
    "Mars has the largest dust storms in the solar system.",
    "The human body contains about 60% water.",
    "Antimatter particles have the opposite charge of their matter counterparts.",
    "The Pythagorean theorem relates the sides of right-angled triangles.",
    "Coral reefs support about 25% of all marine species.",
    "The theory of relativity was developed by Albert Einstein.",
    "Chromosomes carry genetic information in the form of genes.",
    "The moon is gradually moving away from Earth at about 3.8 cm per year.",
    "Dark matter makes up about 27% of the universe's mass-energy content.",
    "The strongest muscle in the human body relative to its size is the masseter (jaw muscle).",
    "Newton's laws of motion describe the relationship between force, mass, and acceleration.",
    "Red blood cells carry oxygen throughout the body using hemoglobin.",
    "The coldest place in the universe is the Boomerang Nebula at -272°C.",
    "Isotopes are atoms of the same element with different numbers of neutrons.",
    "The human nose can detect over 1 trillion different scents.",
    "Saturn's rings are made primarily of ice particles.",
    "Metamorphosis is the process by which some animals drastically change form.",
    "The first law of thermodynamics states that energy cannot be created or destroyed.",
    "Bioluminescence is the production of light by living organisms.",
    "The Earth's atmosphere is composed of 78% nitrogen and 21% oxygen.",
    "Radiocarbon dating can determine the age of organic materials up to 50,000 years old.",
    "The cerebral cortex is responsible for higher-level thinking in humans.",
    "Comets are made of ice, dust, and rocky material.",
    "Archimedes' principle explains why objects float or sink in fluids.",
    "The hottest planet in our solar system is Venus, not Mercury.",
    "Insulin regulates blood sugar levels in the human body.",
    "The Big Bang theory describes the origin of the universe.",
    "Dopamine is a neurotransmitter associated with pleasure and reward.",
    "The Andromeda galaxy is on a collision course with the Milky Way.",
    "Fossil fuels are formed from the remains of ancient organisms.",
    "The human liver can regenerate itself after partial removal.",
    "Semiconductors are materials with electrical conductivity between conductors and insulators.",
    "The Cassini spacecraft revealed that Saturn's moon Enceladus has liquid water.",
    "Mitosis is the process of cell division that produces identical daughter cells.",
    "The Drake equation estimates the number of communicative extraterrestrial civilizations.",
    "Antibodies are proteins produced by the immune system to fight pathogens.",
    "The Sun will eventually become a white dwarf star.",
    "Plate tectonics is the theory explaining the movement of Earth's lithospheric plates.",
    "The Heisenberg uncertainty principle limits precision in quantum measurements.",
    "Glycolysis is the metabolic pathway that converts glucose into pyruvate.",
    "Jupiter's Great Red Spot is a massive storm that has been raging for centuries.",
    "Telomeres are protective caps at the ends of chromosomes.",
    "The speed of sound in air at sea level is approximately 343 meters per second.",
    "Natural selection is the mechanism driving evolution.",
    "The human brain uses about 20% of the body's energy despite being only 2% of its mass.",
    "Supernova explosions create and distribute heavy elements throughout the universe.",
    "Ribosomes are cellular structures that synthesize proteins.",
    "The James Webb Space Telescope can observe in infrared wavelengths.",
    "Genetic mutations are changes in DNA sequences.",
    "The conservation of momentum is a fundamental principle in physics.",
    "Metamorphic rocks are formed by heat and pressure.",
    "The human respiratory system exchanges oxygen and carbon dioxide.",
    "Quarks are fundamental particles that make up protons and neutrons.",
    "The circumference of Earth at the equator is approximately 40,075 kilometers.",
    "Hormones are chemical messengers in the endocrine system.",
    "The Fermi paradox questions why we haven't detected extraterrestrial civilizations.",
    "Photons are particles of light with no mass.",
    "The Amazon rainforest produces about 20% of Earth's oxygen.",
    "Meiosis is cell division that produces gametes with half the chromosome number.",
    "Dark energy is thought to be responsible for the accelerating expansion of the universe.",
    "The human immune system has both innate and adaptive components.",
    "Pulsars are rapidly rotating neutron stars that emit beams of radiation.",
    "Chemical bonds are formed by sharing or transferring electrons.",
    "The water cycle describes the continuous movement of water on Earth.",
    "Transgenic organisms have genes from other species inserted into their genome.",
    "The cosmic microwave background is radiation left over from the Big Bang.",
    "Osmosis is the movement of water across a semipermeable membrane.",
    "The Richter scale measures the magnitude of earthquakes.",
    "Neural plasticity allows the brain to reorganize and form new connections.",
    "Exoplanets are planets orbiting stars outside our solar system.",
    "The atomic number of an element indicates the number of protons in its nucleus.",
    "Biodiversity refers to the variety of life in a particular habitat or ecosystem.",
    "Gravitational waves are ripples in spacetime caused by massive accelerating objects.",
    "The endoplasmic reticulum is involved in protein and lipid synthesis.",
    "Climate change is driven by increased greenhouse gas concentrations.",
    "Redshift indicates that distant galaxies are moving away from us.",
    "The Golgi apparatus modifies and packages proteins for secretion.",
    "Symbiosis describes close relationships between different species.",
    "String theory proposes that fundamental particles are one-dimensional strings.",
    "The nitrogen cycle is essential for converting atmospheric nitrogen into usable forms.",
    "Apoptosis is programmed cell death important for development.",
    "The event horizon is the boundary around a black hole beyond which nothing can escape.",
    "Vestigial structures are remnants of organs that were functional in ancestors.",
    "The photoelectric effect demonstrates the particle nature of light.",
    "Tectonic activity causes earthquakes and volcanic eruptions.",
    "Cloning produces genetically identical organisms.",
    "The cosmic distance ladder is a series of methods for measuring astronomical distances.",
    "Neurotransmitters transmit signals across synapses between neurons.",
    "Renewable energy sources include solar, wind, hydro, and geothermal.",
    "The Schrödinger equation describes how quantum states evolve over time.",
    "Food chains show the flow of energy through ecosystems.",
    "Magnetic resonance imaging (MRI) uses magnetic fields to create body images.",
    "The law of conservation of energy states that energy cannot be created or destroyed.",
    "Epigenetics studies heritable changes that don't involve DNA sequence changes.",
    "White dwarfs are the collapsed cores of medium-sized stars.",
    "The carbon cycle describes the movement of carbon through Earth's systems.",
    "Vaccines have eradicated diseases like smallpox globally.",
    "Gamma-ray bursts are the most energetic explosions in the universe.",
    "Homeostasis is the maintenance of stable internal conditions in organisms.",
    "Moore's Law predicted the doubling of transistors on integrated circuits every two years.",
    "Extremophiles are organisms that thrive in extreme environments.",
    "The twin paradox illustrates time dilation in special relativity.",
    "Keystone species have a disproportionately large effect on their ecosystem.",
    "Lasers produce coherent, monochromatic light through stimulated emission.",
    "The rock cycle describes the transformation of rocks over time.",
    "Gene therapy involves inserting genetic material to treat diseases.",
    "Nebulae are clouds of gas and dust where stars are born.",
    "The pH scale measures acidity and alkalinity.",
    "Migration patterns are influenced by environmental factors and instinct.",
    "Quantum computing uses quantum bits that can exist in superposition.",
    "Continental drift was proposed by Alfred Wegener in 1912.",
    "The endocrine system regulates body functions through hormones.",
    "Gravitational lensing occurs when massive objects bend light.",
    "Succession is the gradual change in species composition in an ecosystem.",
    "Nanotechnology manipulates matter at the atomic and molecular scale.",
    "The fossil record provides evidence for evolution.",
    "Electromagnetism is one of the four fundamental forces.",
    "Biomes are large regions characterized by specific climate and organisms.",
    "Particle accelerators are used to study fundamental particles.",
    "The cell membrane controls what enters and exits the cell.",
    "Renewable resources can be replenished naturally over time.",
    "The Many-Worlds interpretation suggests parallel universes for quantum outcomes.",
    "Photosynthesis and cellular respiration are complementary processes.",
    "Spectroscopy analyzes light to determine chemical composition.",
    "Invasive species can disrupt native ecosystems.",
    "The Standard Model describes fundamental particles and forces.",
    "Metamorphosis occurs in many insects, amphibians, and other animals.",
    "Geothermal energy comes from Earth's internal heat.",
    "Proteins are made of amino acids linked by peptide bonds.",
    "Tidal forces are caused by gravitational differences across an object.",
    "Ecosystems consist of biotic and abiotic components.",
    "Nuclear fission splits atoms to release energy.",
    "Carbohydrates are the primary energy source for most organisms.",
    "The red shift of light indicates objects moving away from the observer.",
    "Decomposers break down dead organic matter.",
    "Semiconductors are essential components in modern electronics.",
    "Lipids include fats, oils, and phospholipids.",
    "The cosmic web is the large-scale structure of the universe.",
    "Mutations are the source of genetic variation.",
    "Radio telescopes detect radio waves from space.",
    "Cellular differentiation allows cells to become specialized.",
    "The electromagnetic spectrum ranges from radio waves to gamma rays.",
    "Predator-prey relationships regulate population sizes.",
    "Superconductors have zero electrical resistance below critical temperature.",
    "The nucleolus produces ribosomal RNA.",
    "Ionizing radiation has enough energy to remove electrons from atoms.",
    "Food webs show complex feeding relationships in ecosystems.",
    "Plasma is the fourth state of matter, consisting of ionized gas.",
    "Genetic drift causes random changes in allele frequencies.",
    "Hubble's Law states that galaxies recede faster the farther they are.",
    "Respiration releases energy from glucose in cells.",
    "Solar flares are massive explosions on the Sun's surface.",
    "Buffers maintain stable pH in biological systems.",
    "Natural resources can be renewable or non-renewable.",
    "Wave-particle duality describes light and matter exhibiting both properties.",
    "Pollination is essential for plant reproduction.",
    "Atomic clocks are the most accurate timekeeping devices.",
    "The trophic pyramid shows energy distribution across levels.",
    "Synthetic biology combines engineering principles with biological systems.",
    "Comets develop tails when approaching the Sun.",
    "Cellular respiration occurs in mitochondria.",
    "Interferometry combines signals from multiple telescopes.",
    "Mutualism is a symbiotic relationship benefiting both species.",
    "Absolute magnitude measures a star's intrinsic brightness.",
    "The phosphorus cycle is essential for DNA and ATP.",
    "Antigens trigger immune responses.",
    "The Higgs boson gives mass to other particles.",
    "Bioindicators are species used to monitor environmental health.",
    "Nuclear fusion combines light atoms to release energy.",
    "Gene expression determines which proteins a cell produces.",
    "Asteroids are rocky objects orbiting the Sun.",
    "Pascal's principle explains hydraulic systems.",
    "Primary productivity is the rate of energy capture by producers.",
    "Quarantine prevents disease spread by isolating infected individuals.",
    "The Pauli exclusion principle prevents electrons from occupying the same quantum state.",
    "Carrying capacity is the maximum population an environment can sustain.",
    "X-rays have shorter wavelengths than visible light.",
    "Transgenic crops can be engineered for pest resistance.",
    "The solar wind is a stream of charged particles from the Sun.",
    "Enzymes have specific active sites for substrate binding.",
    "Accretion disks form around black holes and young stars.",
    "Competition for resources shapes community structure.",
    "Doppler radar uses the Doppler effect to measure wind speed.",
    "The nucleotide is the basic unit of DNA and RNA.",
    "Stellar nucleosynthesis creates elements in stars.",
    "Ecological niches describe a species' role in its ecosystem.",
    "Fluorescence occurs when a substance absorbs and re-emits light.",
    "Ion channels control electrical signals in neurons.",
    "Meteor showers occur when Earth passes through comet debris.",
    "Molecular clocks estimate evolutionary divergence times.",
    "The stratosphere contains the ozone layer.",
    "Activation energy is required to start chemical reactions.",
    "Mass extinctions have occurred multiple times in Earth's history.",
    "Supermassive black holes exist at the centers of most galaxies.",
    "Feedback loops regulate biological systems.",
    "The mesosphere is where most meteors burn up.",
    "Covalent bonds involve sharing electrons between atoms.",
    "Habitat fragmentation threatens biodiversity.",
    "Pulsars were initially mistaken for signals from alien civilizations.",
    "The citric acid cycle is central to cellular metabolism.",
    "Solar eclipses occur when the Moon passes between Earth and the Sun.",
    "Biological magnification concentrates toxins up food chains.",
    "Transistors are the fundamental building blocks of modern computers.",
    "The thermosphere is the hottest atmospheric layer.",
    "Isotonic solutions have equal solute concentrations.",
    "Introduced species may become invasive without natural predators.",
    "Cosmic rays are high-energy particles from space.",
    "Alleles are different versions of the same gene.",
    "Van der Waals forces are weak intermolecular attractions.",
    "Deforestation contributes to climate change and biodiversity loss.",
    "Brown dwarfs are failed stars too small to sustain fusion.",
    "The sodium-potassium pump maintains cell membrane potential.",
    "Glaciers store about 69% of Earth's fresh water.",
    "Oxidation involves the loss of electrons in chemical reactions.",
    "Biogeochemical cycles move elements through living and non-living components.",
    "Red giants are dying stars that have exhausted their hydrogen fuel.",
    "Capillary action allows water to move through narrow spaces.",
    "Wetlands filter water and provide critical habitat.",
    "Redox reactions involve the transfer of electrons.",
    "The Kuiper Belt contains icy objects beyond Neptune.",
    "Hormones travel through the bloodstream to target organs.",
    "Coral bleaching occurs when stressed corals expel symbiotic algae.",
    "Fermentation produces energy without oxygen.",
    "Cepheid variables are used to measure cosmic distances.",
    "Alleles can be dominant or recessive.",
    "The thermocline is a rapid temperature change layer in oceans.",
    "Bioremediation uses organisms to clean up pollution.",
    "Stellar parallax measures distances to nearby stars.",
    "Vesicles transport materials within cells.",
    "Desertification is the degradation of arid lands.",
    "Main sequence stars are in equilibrium, fusing hydrogen.",
    "Osmotic pressure drives water movement in plants.",
    "Keystone predators regulate prey populations.",
    "Beta decay converts neutrons to protons or vice versa.",
    "The phospholipid bilayer forms cell membranes.",
    "Ocean acidification threatens marine life.",
    "Binary stars orbit around a common center of mass.",
    "The Calvin cycle fixes carbon dioxide in photosynthesis.",
    "Indicator species signal environmental changes.",
    "Half-life is the time for half of a radioactive sample to decay.",
    "Producers convert light energy into chemical energy.",
    "Tsunamis are caused by underwater earthquakes or landslides.",
    "Ionic bonds form through electron transfer between atoms.",
    "Mycorrhizae are symbiotic fungi-plant root associations.",
    "Variable stars change brightness over time.",
    "Lysosomes digest cellular waste and foreign material.",
    "El Niño is a climate pattern affecting global weather.",
    "Cathode rays are streams of electrons.",
    "Codons are three-nucleotide sequences coding for amino acids.",
    "Open clusters are loose groups of young stars.",
    "Turgor pressure maintains plant cell rigidity.",
    "Eutrophication is nutrient enrichment causing algal blooms.",
    "Alpha particles consist of two protons and two neutrons.",
    "Ribosomes can be free or attached to endoplasmic reticulum.",
    "Volcanic eruptions can affect global climate.",
    "Chromosomal crossover increases genetic diversity.",
    "Globular clusters are dense, spherical groups of old stars.",
    "The stomata regulate gas exchange in leaves.",
    "Ocean currents distribute heat around the planet.",
    "Isotopes of hydrogen include protium, deuterium, and tritium.",
    "The founder effect occurs when a small group establishes a new population.",
    "Planetary nebulae are shells of gas ejected by dying stars.",
    "Action potentials are electrical signals in neurons.",
    "Permafrost is ground that remains frozen year-round.",
    "Noble gases are chemically inert elements.",
    "Coevolution occurs when species influence each other's evolution.",
    "Sunspots are cooler regions on the Sun's surface.",
    "Dendrites receive signals from other neurons.",
    "Ice ages are periods of extensive glaciation.",
    "Catalysts speed up reactions without being consumed.",
    "Ecological succession leads to a climax community.",
    "Solar prominences are large loops of plasma on the Sun.",
    "The myelin sheath insulates axons for faster signal transmission.",
    "Monsoons are seasonal wind patterns bringing heavy rainfall.",
    "Activation energy can be lowered by catalysts.",
    "Pioneer species colonize barren environments.",
    "Coronal mass ejections can disrupt satellites and power grids.",
    "Neurotransmitters are reabsorbed or broken down after release.",
    "Jet streams are fast-moving air currents in the upper atmosphere.",
    "Le Chatelier's principle predicts how systems respond to changes.",
    "Biodiversity hotspots have high species richness and endemism.",
    "Solar cycles last approximately 11 years.",
    "Dendrochronology dates trees using growth rings.",
    "Savannas are grasslands with scattered trees.",
    "Equilibrium constants measure reaction completeness.",
    "Edge effects influence species at habitat boundaries.",
    "Cosmic inflation explains the universe's uniformity.",
    "Lichens are symbiotic associations of fungi and algae or cyanobacteria.",
    "Tundra ecosystems have short growing seasons and permafrost.",
    "Reaction rates increase with temperature.",
    "Metapopulations consist of connected subpopulations.",
    "The solar constant is the energy received per unit area at Earth's distance.",
    "Auxins are plant hormones regulating growth.",
    "Taiga is the world's largest terrestrial biome.",
    "Concentration gradients drive diffusion.",
    "Population bottlenecks reduce genetic diversity.",
    "Differential rotation causes sunspots to form.",
    "Gibberellins promote stem elongation in plants.",
    "Estuaries are productive ecosystems where rivers meet the sea.",
    "Surface tension allows water to form droplets.",
    "Gene flow exchanges alleles between populations.",
    "The photosphere is the visible surface of the Sun.",
    "Cytokinins promote cell division in plants.",
    "Alpine ecosystems exist at high elevations.",
    "Capillarity helps plants transport water upward.",
    "Genetic bottlenecks increase the effects of genetic drift.",
    "The chromosphere is the reddish layer above the photosphere.",
    "Ethylene regulates fruit ripening.",
    "Mangrove forests protect coastlines and provide nurseries.",
    "Hydrogen bonds give water unique properties.",
    "Hardy-Weinberg equilibrium describes stable allele frequencies.",
    "The corona is the Sun's outer atmosphere visible during eclipses.",
    "Abscisic acid helps plants respond to stress.",
    "Chaparral ecosystems have hot, dry summers and mild, wet winters.",
    "Adhesion allows water to stick to other surfaces.",
    "Punctuated equilibrium proposes rapid evolution followed by stasis.",
    "Solar neutrinos are produced by fusion in the Sun's core.",
    "Tropisms are directional growth responses in plants.",
    "Pelagic zones are open ocean regions.",
    "Cohesion allows water molecules to stick together.",
    "Allopatric speciation occurs when populations are geographically separated.",
    "Helioseismology studies the Sun's interior using vibrations.",
    "Photoperiodism is plant response to day length.",
    "Benthic zones are ocean floor regions.",
    "Hydrophobic substances repel water.",
    "Sympatric speciation occurs without geographic separation.",
    "The solar dynamo generates the Sun's magnetic field.",
    "Vernalization requires cold exposure for flowering.",
    "Aphotic zones receive no sunlight.",
    "Hydrophilic substances are attracted to water.",
    "Adaptive radiation produces many species from a common ancestor.",
    "Solar flares release energy equivalent to billions of nuclear bombs.",
    "Nitrogen fixation converts atmospheric nitrogen to usable forms.",
    "Hadal zones are the deepest ocean trenches.",
    "Amphipathic molecules have both hydrophobic and hydrophilic parts.",
    "Convergent evolution produces similar features in unrelated species.",
    "The heliosphere is the Sun's influence region.",
    "Mycorrhizae increase plant nutrient uptake.",
    "Intertidal zones experience regular tidal changes.",
    "Enzymes are denatured by extreme temperatures or pH.",
    "Analogous structures have similar functions but different origins.",
    "Parker Solar Probe is studying the Sun up close.",
    "Nodules on legume roots house nitrogen-fixing bacteria.",
    "Upwelling brings nutrient-rich water to the surface.",
    "Competitive inhibitors bind to enzyme active sites.",
    "Homologous structures indicate common ancestry.",
    "The solar wind creates Earth's magnetosphere boundaries.",
    "C4 photosynthesis is adapted for hot, dry conditions.",
    "Thermoclines stratify water temperature in oceans and lakes.",
    "Allosteric regulation changes enzyme shape.",
    "Vestigial organs are evolutionary remnants with no current function.",
    "Sungrazer comets pass extremely close to the Sun.",
    "CAM photosynthesis allows desert plants to conserve water.",
    "Oligotrophic lakes have low nutrient levels.",
    "Cofactors are non-protein enzyme helpers."
  ]
}
